Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.7.217/saml21a1/edc/ATSAML21G18A.PIC
<?xml version='1.0' encoding='UTF-8' standalone='no'?>
<edc:PIC xmlns:atdf="http://crownking/atdf" xmlns:edc="http://crownking/edc" xmlns:ltx="http://crownking/ltx" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd" edc:name="ATSAML21G18A" edc:arch="arm32bit" edc:procid="0x0000" atdf:architecture="CORTEX-M0PLUS" atdf:family="SAML" edc:hasFreeze="false" edc:atsamname="ATSAML21G18A">
  <edc:Properties>
    <edc:Property edc:propkey="file.registers.are.odd.address.accessible" edc:propvalue="true"/>
  </edc:Properties>
  <edc:Power>
    <edc:VDD edc:minvoltage="1.62" edc:maxvoltage="3.63" edc:nominalvoltage="3.300"/>
  </edc:Power>
  <edc:Programming edc:haslvp2="true">
    <edc:ProgrammingRowSize edc:progop="rowerase" edc:nzsize="256"/>
  </edc:Programming>
  <edc:ArchDef edc:name="arm32bit" edc:desc="arm32bit">
    <edc:MemTraits edc:addrinc="0x1" edc:locsize="0x1" edc:wordimpl="0xFFFFFFFF" edc:wordinit="0xFFFFFFFF" edc:wordsafe="0xFFFFFFFF" edc:wordsize="0x4"/>
  </edc:ArchDef>
  <edc:InstructionSet edc:instructionsetid="armv6m"/>
  <edc:InterruptList>
    <edc:Interrupt edc:irq="-15" edc:cname="Reset" edc:desc="Reset Vector, invoked on Power up and warm reset"/>
    <edc:Interrupt edc:irq="-14" edc:cname="NonMaskableInt" edc:desc="Non maskable Interrupt, cannot be stopped or preempted"/>
    <edc:Interrupt edc:irq="-13" edc:cname="HardFault" edc:desc="Hard Fault, all classes of Fault"/>
    <edc:Interrupt edc:irq="-5" edc:cname="SVCall" edc:desc="System Service Call via SVC instruction"/>
    <edc:Interrupt edc:irq="-2" edc:cname="PendSV" edc:desc="Pendable request for system service"/>
    <edc:Interrupt edc:irq="-1" edc:cname="SysTick" edc:desc="System Tick Timer"/>
    <edc:Interrupt edc:irq="0" edc:cname="SYSTEM" edc:desc="" ltx:memberofperipheral="MCLK OSCCTRL OSC32KCTRL PAC PM SUPC"/>
    <edc:Interrupt edc:irq="1" edc:cname="WDT" edc:desc="" ltx:memberofperipheral="WDT"/>
    <edc:Interrupt edc:irq="2" edc:cname="RTC" edc:desc="" ltx:memberofperipheral="RTC"/>
    <edc:Interrupt edc:irq="3" edc:cname="EIC" edc:desc="" ltx:memberofperipheral="EIC"/>
    <edc:Interrupt edc:irq="4" edc:cname="NVMCTRL" edc:desc="" ltx:memberofperipheral="NVMCTRL"/>
    <edc:Interrupt edc:irq="5" edc:cname="DMAC" edc:desc="" ltx:memberofperipheral="DMAC"/>
    <edc:Interrupt edc:irq="6" edc:cname="USB" edc:desc="" ltx:memberofperipheral="USB"/>
    <edc:Interrupt edc:irq="7" edc:cname="EVSYS" edc:desc="" ltx:memberofperipheral="EVSYS"/>
    <edc:Interrupt edc:irq="8" edc:cname="SERCOM0" edc:desc="" ltx:memberofperipheral="SERCOM0"/>
    <edc:Interrupt edc:irq="9" edc:cname="SERCOM1" edc:desc="" ltx:memberofperipheral="SERCOM1"/>
    <edc:Interrupt edc:irq="10" edc:cname="SERCOM2" edc:desc="" ltx:memberofperipheral="SERCOM2"/>
    <edc:Interrupt edc:irq="11" edc:cname="SERCOM3" edc:desc="" ltx:memberofperipheral="SERCOM3"/>
    <edc:Interrupt edc:irq="12" edc:cname="SERCOM4" edc:desc="" ltx:memberofperipheral="SERCOM4"/>
    <edc:Interrupt edc:irq="13" edc:cname="SERCOM5" edc:desc="" ltx:memberofperipheral="SERCOM5"/>
    <edc:Interrupt edc:irq="14" edc:cname="TCC0" edc:desc="" ltx:memberofperipheral="TCC0"/>
    <edc:Interrupt edc:irq="15" edc:cname="TCC1" edc:desc="" ltx:memberofperipheral="TCC1"/>
    <edc:Interrupt edc:irq="16" edc:cname="TCC2" edc:desc="" ltx:memberofperipheral="TCC2"/>
    <edc:Interrupt edc:irq="17" edc:cname="TC0" edc:desc="" ltx:memberofperipheral="TC0"/>
    <edc:Interrupt edc:irq="18" edc:cname="TC1" edc:desc="" ltx:memberofperipheral="TC1"/>
    <edc:Interrupt edc:irq="21" edc:cname="TC4" edc:desc="" ltx:memberofperipheral="TC4"/>
    <edc:Interrupt edc:irq="22" edc:cname="ADC" edc:desc="" ltx:memberofperipheral="ADC"/>
    <edc:Interrupt edc:irq="23" edc:cname="AC" edc:desc="" ltx:memberofperipheral="AC"/>
    <edc:Interrupt edc:irq="24" edc:cname="DAC" edc:desc="" ltx:memberofperipheral="DAC"/>
    <edc:Interrupt edc:irq="25" edc:cname="PTC" edc:desc="" ltx:memberofperipheral="PTC"/>
    <edc:Interrupt edc:irq="26" edc:cname="AES" edc:desc="" ltx:memberofperipheral="AES"/>
    <edc:Interrupt edc:irq="27" edc:cname="TRNG" edc:desc="" ltx:memberofperipheral="TRNG"/>
  </edc:InterruptList>
  <edc:PeripheralList>
    <edc:Peripheral edc:cname="AC" edc:desc=""/>
    <edc:Peripheral edc:cname="ADC" edc:desc=""/>
    <edc:Peripheral edc:cname="AES" edc:desc=""/>
    <edc:Peripheral edc:cname="CCL" edc:desc=""/>
    <edc:Peripheral edc:cname="DAC" edc:desc=""/>
    <edc:Peripheral edc:cname="DMAC" edc:desc=""/>
    <edc:Peripheral edc:cname="DSU" edc:desc=""/>
    <edc:Peripheral edc:cname="EIC" edc:desc=""/>
    <edc:Peripheral edc:cname="EVSYS" edc:desc=""/>
    <edc:Peripheral edc:cname="GCLK" edc:desc=""/>
    <edc:Peripheral edc:cname="MCLK" edc:desc=""/>
    <edc:Peripheral edc:cname="MTB" edc:desc=""/>
    <edc:Peripheral edc:cname="NVMCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="FUSES" edc:desc=""/>
    <edc:Peripheral edc:cname="OPAMP" edc:desc=""/>
    <edc:Peripheral edc:cname="OSCCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="OSC32KCTRL" edc:desc=""/>
    <edc:Peripheral edc:cname="PAC" edc:desc=""/>
    <edc:Peripheral edc:cname="PM" edc:desc=""/>
    <edc:Peripheral edc:cname="PORT" edc:desc=""/>
    <edc:Peripheral edc:cname="PTC" edc:desc=""/>
    <edc:Peripheral edc:cname="RSTC" edc:desc=""/>
    <edc:Peripheral edc:cname="RTC" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM0" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM1" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM2" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM3" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM4" edc:desc=""/>
    <edc:Peripheral edc:cname="SERCOM5" edc:desc=""/>
    <edc:Peripheral edc:cname="SUPC" edc:desc=""/>
    <edc:Peripheral edc:cname="TC0" edc:desc=""/>
    <edc:Peripheral edc:cname="TC1" edc:desc=""/>
    <edc:Peripheral edc:cname="TC4" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC0" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC1" edc:desc=""/>
    <edc:Peripheral edc:cname="TCC2" edc:desc=""/>
    <edc:Peripheral edc:cname="TRNG" edc:desc=""/>
    <edc:Peripheral edc:cname="USB" edc:desc=""/>
    <edc:Peripheral edc:cname="WDT" edc:desc=""/>
    <edc:Peripheral edc:cname="NVIC" edc:desc=""/>
    <edc:Peripheral edc:cname="SysTick" edc:desc=""/>
    <edc:Peripheral edc:cname="SystemControl" edc:desc=""/>
  </edc:PeripheralList>
  <edc:PhysicalSpace>
    <edc:NMMRPlace edc:regionid="corenmmrs">
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R0" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="0"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R1" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="4"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R2" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="8"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R3" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="12"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R4" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="16"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R5" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="20"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R6" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="24"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R7" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="28"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R8" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="32"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R9" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="36"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R10" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="40"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R11" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="44"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="R12" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="General-Purpose Register" edc:nmmrid="48"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="SP" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Stack Pointer" edc:nmmrid="52"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="MSP" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Main Stack Pointer" edc:nmmrid="64"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PSP" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Process Stack Pointer" edc:nmmrid="68"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="LR" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="11111111111111111111111111111111" edc:mclr="11111111111111111111111111111111" edc:desc="Link Register" edc:nmmrid="56"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PC" edc:impl="0xFFFFFFFF" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Program Counter" edc:nmmrid="60"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PSR" edc:impl="0xF100003F" edc:access="nnnn---n------------------nnnnnn" edc:por="00000001000000000000000000000000" edc:mclr="00000001000000000000000000000000" edc:desc="Program Status Register" edc:nmmrid="72"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="APSR" edc:impl="0xF0000000" edc:access="nnnn----------------------------" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Application Program Status Register" edc:nmmrid="76"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="IPSR" edc:impl="0x3F" edc:access="--------------------------rrrrrr" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Interrupt Program Status Register" edc:nmmrid="80"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="EPSR" edc:impl="0x1000000" edc:access="-------r------------------------" edc:por="00000001000000000000000000000000" edc:mclr="00000001000000000000000000000000" edc:desc="Execution Program Status Register" edc:nmmrid="84"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="PRIMASK" edc:impl="0x1" edc:access="-------------------------------n" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Priority Mask Register" edc:nmmrid="88"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="CONTROL" edc:impl="0x3" edc:access="------------------------------nn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:desc="Control Register" edc:nmmrid="100"/>
    </edc:NMMRPlace>
    <edc:CodeSector edc:regionid="IFLASH" edc:beginaddr="0x0" edc:endaddr="0x40000" atdf:pagesize="0x40" edc:rw="rw"/>
    <edc:UserZone edc:regionid="USER_PAGE" edc:beginaddr="0x804000" edc:endaddr="0x804100" atdf:pagesize="0x40" edc:rw="rw" edc:erasepagesize="0x100"/>
    <edc:ConfigFuseSector edc:regionid="USER_FUSES" edc:beginaddr="0x804000" edc:endaddr="0x804008" atdf:pagesize="0x40" edc:erasepagesize="0x100">
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="USER_WORD_0" edc:nzwidth="0x20" edc:impl="0xFC81FF77" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x0" edc:access="nnnnnn--n------nnnnnnnnn-nnn-nnn" edc:_addr="0x804000" edc:default="0x0">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="NVMCTRL_BOOTPROT" edc:nzwidth="0x3" edc:desc="Bootloader Size"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="NVMCTRL_EEPROM_SIZE" edc:nzwidth="0x3" edc:desc="EEPROM Size"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:DCRFieldDef edc:cname="BOD33USERLEVEL" edc:nzwidth="0x6" edc:desc="BOD33 User Level"/>
            <edc:DCRFieldDef edc:cname="BOD33_DIS" edc:nzwidth="0x1" edc:desc="BOD33 Disable">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOD33_ACTION" edc:nzwidth="0x2" edc:desc="BOD33 Action"/>
            <edc:AdjustPoint edc:offset="0x6"/>
            <edc:DCRFieldDef edc:cname="BOD12_DIS" edc:nzwidth="0x1" edc:desc="BOD12 Disable">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:DCRFieldDef edc:cname="WDT_ENABLE" edc:nzwidth="0x1" edc:desc="WDT Enable">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDT_ALWAYSON" edc:nzwidth="0x1" edc:desc="WDT Always On">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WDT_PER" edc:nzwidth="0x4" edc:desc="WDT Period"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef ltx:memberofperipheral="FUSES" edc:cname="USER_WORD_1" edc:nzwidth="0x20" edc:impl="0xFFFF07FF" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" edc:factorydefault="0x0" edc:access="nnnnnnnnnnnnnnnn-----nnnnnnnnnnn" edc:_addr="0x804004" edc:default="0x0">
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="FUSES">
            <edc:DCRFieldDef edc:cname="WDT_WINDOW" edc:nzwidth="0x4" edc:desc="WDT Window"/>
            <edc:DCRFieldDef edc:cname="WDT_EWOFFSET" edc:nzwidth="0x4" edc:desc="WDT Early Warning Offset"/>
            <edc:DCRFieldDef edc:cname="WDT_WEN" edc:nzwidth="0x1" edc:desc="WDT Window Mode Enable">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOD33_HYST" edc:nzwidth="0x1" edc:desc="BOD33 Hysteresis">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="BOD12_HYST" edc:nzwidth="0x1" edc:desc="BOD12 Hysteresis">
              <edc:DCRFieldSemantic edc:cname="SET" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CLEAR" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:DCRFieldDef edc:cname="NVMCTRL_REGION_LOCKS" edc:nzwidth="0x10" edc:desc="NVM Region Locks"/>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
    </edc:ConfigFuseSector>
    <edc:UserIDSector edc:regionid="userid" edc:beginaddr="0x804008" edc:endaddr="0x804100" atdf:pagesize="0x40" edc:erasepagesize="0x100"/>
    <edc:CodeSector edc:regionid="RWW" edc:beginaddr="0x400000" edc:endaddr="0x402000" atdf:pagesize="0x40" edc:rw="rw"/>
    <edc:GPRDataSector edc:regionid="HSRAM" edc:beginaddr="0x20000000" edc:endaddr="0x20008000" edc:isexecutable="true" edc:rw="rw"/>
    <edc:GPRDataSector edc:regionid="LPRAM" edc:beginaddr="0x30000000" edc:endaddr="0x30002000" edc:isexecutable="true" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="HPB0" edc:beginaddr="0x40000000" edc:endaddr="0x40004000" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="HPB1" edc:beginaddr="0x41000000" edc:endaddr="0x41010000" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="HPB2" edc:beginaddr="0x42000000" edc:endaddr="0x42008000" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="HPB3" edc:beginaddr="0x43000000" edc:endaddr="0x43002000" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="HPB4" edc:beginaddr="0x44000000" edc:endaddr="0x44001000" edc:rw="rw"/>
    <edc:SFRDataSector edc:regionid="PPB" edc:beginaddr="0xE0000000" edc:endaddr="0xE000ED34" edc:rw="rw">
      <edc:AdjustPoint edc:offset="0xE004" edc:_addr="0xE0000000"/>
      <edc:SFRDef edc:nzwidth="0x20" edc:cname="ICTR" edc:impl="0xF" edc:access="----------------------------rrrr" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:desc="Interrupt Controller Type Register" edc:_addr="0xE000E004">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:nzwidth="0x4" edc:cname="INTLINESNUM" edc:desc="Number of interrupt lines supported by NVIC in granularities of 32."/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:offset="0x8" edc:_addr="0xE000E008"/>
      <edc:SFRDef ltx:memberofperipheral="SysTick" edc:cname="CSR" edc:nzwidth="0x20" edc:access="---------------n-------------nnn" edc:por="00000000000000000000000000000100" edc:mclr="00000000000000000000000000000100" edc:impl="0x10007" edc:_addr="0xE000E010">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SysTick">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:nzwidth="0x1" edc:desc="SysTick Counter Enable">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Counter disabled" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Counter enabled" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="TICKINT" edc:nzwidth="0x1" edc:desc="SysTick Exception Request Enable">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="Counting down to 0 does not assert the SysTick exception request" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Counting down to 0 asserts the SysTick exception request" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CLKSOURCE" edc:nzwidth="0x1" edc:desc="Clock Source 0=external, 1=processor">
              <edc:SFRFieldSemantic edc:cname="VALUE_0" edc:desc="External clock" edc:when="(field &amp; 0x1) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="VALUE_1" edc:desc="Processor clock" edc:when="(field &amp; 0x1) == 0x01"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0xD"/>
            <edc:SFRFieldDef edc:cname="COUNTFLAG" edc:nzwidth="0x1" edc:desc="Timer counted to 0 since last read of register"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
