Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML21_DFP/3.7.217/saml21a1/edc/ATSAML21G18A.PIC
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0EVCTRL" edc:nzwidth="0x20" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:por="00000000000000000000000000000000" edc:mclr="00000000000000000000000000000000" edc:_addr="0x4000282C">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PID0" edc:nzwidth="0x5" edc:desc="Port Event Pin Identifier 0"/>
            <edc:SFRFieldDef edc:cname="EVACT0" edc:nzwidth="0x2" edc:desc="Port Event Action 0"/>
            <edc:SFRFieldDef edc:cname="PORTEI0" edc:nzwidth="0x1" edc:desc="Port Event Enable Input 0"/>
            <edc:SFRFieldDef edc:cname="PID1" edc:nzwidth="0x5" edc:desc="Port Event Pin Identifier 1"/>
            <edc:SFRFieldDef edc:cname="EVACT1" edc:nzwidth="0x2" edc:desc="Port Event Action 1"/>
            <edc:SFRFieldDef edc:cname="PORTEI1" edc:nzwidth="0x1" edc:desc="Port Event Enable Input 1"/>
            <edc:SFRFieldDef edc:cname="PID2" edc:nzwidth="0x5" edc:desc="Port Event Pin Identifier 2"/>
            <edc:SFRFieldDef edc:cname="EVACT2" edc:nzwidth="0x2" edc:desc="Port Event Action 2"/>
            <edc:SFRFieldDef edc:cname="PORTEI2" edc:nzwidth="0x1" edc:desc="Port Event Enable Input 2"/>
            <edc:SFRFieldDef edc:cname="PID3" edc:nzwidth="0x5" edc:desc="Port Event Pin Identifier 3"/>
            <edc:SFRFieldDef edc:cname="EVACT3" edc:nzwidth="0x2" edc:desc="Port Event Action 3"/>
            <edc:SFRFieldDef edc:cname="PORTEI3" edc:nzwidth="0x1" edc:desc="Port Event Enable Input 3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PMUX0" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x40002830">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Even-Numbered Pin"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PMUX1" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x40002831">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Even-Numbered Pin"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PMUX2" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x40002832">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Even-Numbered Pin"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PMUX3" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x40002833">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Even-Numbered Pin"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PMUX4" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x40002834">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Even-Numbered Pin"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PMUX5" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x40002835">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Even-Numbered Pin"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PMUX6" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x40002836">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Even-Numbered Pin"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef ltx:memberofperipheral="PORT" edc:cname="GROUP0PMUX7" edc:nzwidth="0x8" edc:access="nnnnnnnn" edc:por="00000000" edc:mclr="00000000" edc:_addr="0x40002837">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PORT">
            <edc:SFRFieldDef edc:cname="PMUXE" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Even-Numbered Pin"/>
            <edc:SFRFieldDef edc:cname="PMUXO" edc:nzwidth="0x4" edc:desc="Peripheral Multiplexing for Odd-Numbered Pin"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
